{
  "jobs": [
    {
      "id": 10,
      "title": "IT Technical Lead - Customer Applications",
      "location": "Multiple Locations (Wilmington, DE | Colorado Springs, CO | Mississauga, ON, Canada)",
      "type": "IT",
      "employmentType": "Full-Time",
      "shortDescription": "Lead the technical design and implementation of entitlement management and software licensing platforms for a pharmaceutical/biotech organization.",
      "fullDescription": "Enat Solution, on behalf of our client in the Pharmaceutical/Biotech industry, is seeking a highly experienced IT Technical Lead – Customer Applications to architect and implement a next-generation entitlement management and software licensing platform.\n\nThe ideal candidate will provide strong technical leadership, drive the design of scalable solutions, and work closely with cross-functional teams to ensure successful implementation and long-term adoption. This position follows a hybrid model (3 onsite / 2 remote).",
      "responsibilities": [
        "Lead the end-to-end technical design and implementation of entitlement and software licensing solutions",
        "Develop deep expertise in licensing and entitlement platforms to ensure best-practice adoption",
        "Architect scalable B2B license management and monetization solutions for software products",
        "Ensure alignment with enterprise architecture, compliance requirements, and IT policies",
        "Partner with cross-functional business teams, product teams, and stakeholders to define requirements and deliver optimal solutions",
        "Guide teams in integrating entitlement systems with enterprise platforms such as ERP and other backend systems",
        "Solve day-to-day operational challenges and implement optimizations to improve system performance",
        "Deliver clear technical documentation, presentations, and communications for global stakeholders",
        "Drive seamless integration with backend ERP systems and customer-facing applications",
        "Ensure compliance with privacy and regulatory frameworks such as PII, GDPR, and CFR",
        "Implement secure solutions using AWS access control and industry-standard practices"
      ],
      "qualifications": [
        "Bachelor's degree in Computer Science or equivalent experience",
        "8+ years of experience in core computer science principles, algorithms, and enterprise architecture",
        "2+ years as a technical lead guiding medium to large teams",
        "Expertise in designing IT enterprise solutions using both custom-built and off-the-shelf technologies",
        "Strong experience with backend integration involving ERP platforms",
        "Background in building customer-facing applications and understanding of usability principles",
        "Proficiency in backend scripting languages such as JavaScript/TypeScript (Node.js) or Python",
        "Hands-on experience with AWS services (storage, caching, API Gateway, IAM)",
        "Strong understanding of B2B licensing and software monetization concepts",
        "Experience working in Agile/SCRUM environments",
        "Excellent communication, documentation, and stakeholder engagement skills",
        "Strong attention to detail, deadline-driven, and able to work independently"
      ],
      "benefits": [
        "Competitive compensation package",
        "Hybrid work arrangement (3 days onsite, 2 days remote)",
        "Comprehensive health, dental, and vision coverage",
        "401(k) with company match",
        "Professional development & advancement opportunities",
        "Occasional travel for cross-site collaboration"
      ],
      "aboutCompany": "Our client is a leading pharmaceutical/biotech organization seeking to implement next-generation entitlement management and software licensing platforms. They value technical excellence, innovation, and strong leadership in building scalable enterprise solutions.",
      "applyEmail": "info@enatsolution.com",
      "postedDate": "2025-11-21",
      "status": "active"
    },
    {
      "id": 9,
      "title": "Senior Digital Transformation Engineer (Manufacturing | ERP & Automation)",
      "location": "Ayer, MA (Hybrid)",
      "type": "IT",
      "employmentType": "Full-Time",
      "shortDescription": "Lead enterprise-wide digital transformation initiatives across ERP, automation, and system integrations for a leading manufacturing organization.",
      "fullDescription": "Enat Solution is partnering with a leading manufacturing organization to hire a Senior Digital Transformation Engineer. This role is ideal for a technical professional who can bridge business and technology leading modern digital initiatives, optimizing systems, and driving automation across enterprise operations.\n\nYou will help transform legacy systems into integrated, scalable, and efficient digital platforms while working closely with leaders across IT, Finance, Operations, and Engineering.",
      "responsibilities": [
        "Lead enterprise-wide digital transformation initiatives across ERP, order management, fulfillment, eCommerce, and system integrations",
        "Mentor and guide software developers & digital engineers; support professional development and technical excellence",
        "Serve as an internal consultant to identify process bottlenecks and deliver scalable automated solutions",
        "Manage external vendors and offshore development teams ensuring quality delivery and adherence to timelines",
        "Develop and maintain Python automation tools (Pandas, NumPy) for data workflows, APIs, and reporting",
        "Partner with Finance/Operations to build reports, reconcile inventory, and improve analytics capabilities",
        "Evaluate technology platforms (ERP, MES, CMMS, B2B/B2C, analytics, personalization tools) and make recommendations",
        "Create business cases with ROI analysis for digital investments and transformation initiatives",
        "Oversee websites, domains, and analytics tools with strong focus on compliance (GDPR, CCPA)",
        "Collaborate with IT/Help Desk to document infrastructure and ensure business continuity planning"
      ],
      "qualifications": [
        "6+ years of digital transformation or IT engineering experience",
        "Strong background in ERP systems, automation, and digital architecture",
        "Proficiency with Python (Pandas, NumPy)",
        "Experience managing development teams and external vendors",
        "Solid understanding of modern digital platforms and enterprise architectures",
        "Bachelor's Degree required"
      ],
      "benefits": [
        "Performance-based bonus program",
        "Comprehensive health, dental, and vision coverage",
        "Paid time off & holidays",
        "401(k) with company match",
        "Professional development & advancement opportunities",
        "Employee discount programs"
      ],
      "aboutCompany": "Our partner is a leading manufacturing organization in the pharmaceuticals and manufacturing industry. They are undergoing digital transformation to modernize legacy systems into integrated, scalable, and efficient digital platforms.",
      "applyEmail": "info@enatsolution.com",
      "postedDate": "2025-11-14",
      "status": "active"
    },
    {
      "id": 8,
      "title": "Executive Operations Manager",
      "location": "Remote (U.S. – East Coast hours required)",
      "type": "General",
      "employmentType": "Full-Time Equivalent",
      "shortDescription": "Oversee day-to-day operations and provide executive support for a mission-driven humanitarian organization.",
      "fullDescription": "Enat Solution is seeking an Executive Operations Manager on behalf of our client, a mission-driven humanitarian organization dedicated to protecting life and delivering critical support in some of the world's most challenging environments.\n\nThis role is ideal for a candidate who thrives on structure, organization, and operational precision. You will oversee day-to-day operations, support the CEO, coordinate administrative workflows, and ensure internal processes run efficiently across programs, partnerships, and logistics.\n\nThis is an opportunity to contribute to meaningful, high-impact humanitarian work while supporting leaders operating in dynamic environments.",
      "responsibilities": [
        "Manage daily administrative functions, calendars, and task tracking",
        "Supervise and coordinate administrative staff, contractors, and volunteers",
        "Maintain organization-wide schedules, operational documents, and tracking systems",
        "Provide high-level executive support to the CEO (briefings, prep, follow-ups, reporting)",
        "Assist with travel logistics, events, and partner coordination",
        "Develop, improve, and enforce internal procedures for communication and documentation",
        "Uphold strict confidentiality and data protection protocols",
        "Act as a primary liaison between field teams, partners, donors, and vendors",
        "Track program performance metrics, deliverables, and partner feedback",
        "Prepare monthly or quarterly reports and operational updates for leadership",
        "Maintain contact databases, partnership records, and tracking spreadsheets",
        "Support communications and documentation for humanitarian and medical missions",
        "Assist in procurement, shipping logistics, and compliance with export/customs regulations",
        "Implement and maintain document control processes for sensitive materials",
        "Coordinate with accounting/finance teams on timesheets, reimbursements, and vendor payments",
        "Prepare executive summaries, operational briefings, and donor-facing updates",
        "Draft official correspondence, letters, and organizational communication templates",
        "Maintain standardized document formats and communication guidelines",
        "Support proposal development and donor reporting requirements",
        "Assist with internal planning, training sessions, and team coordination meetings",
        "Optimize digital filing and knowledge-management systems (Microsoft 365, SharePoint, Teams)"
      ],
      "qualifications": [
        "5+ years of experience in operations, executive support, or administrative management (nonprofit, defense, or government sector strongly preferred)",
        "Strong proficiency in Microsoft 365 (Teams, SharePoint, Excel, Outlook)",
        "Exceptional written, organizational, and multitasking abilities",
        "Experience with CRM, project management, or workflow tools is a plus",
        "Ability to work independently, manage sensitive information, and uphold professionalism",
        "U.S. Citizen and able to pass background verification",
        "Military background or military spouse highly preferred"
      ],
      "benefits": [
        "Compensation: $40 - $50/hour",
        "Full-Time Equivalent position with meaningful humanitarian impact",
        "Support elite Special Operations Veterans and global crisis response efforts",
        "Occasional travel for event support or coordination",
        "Opportunity to contribute to life-saving services in vulnerable communities",
        "Work with highly skilled professionals in dynamic environments"
      ],
      "aboutCompany": "Our client is a mission-driven humanitarian organization dedicated to protecting life and delivering critical support in some of the world's most challenging environments. The team is composed of highly skilled professionals including elite Special Operations Veterans who bring leadership, resilience, and excellence to global crisis response and aid efforts.",
      "applyEmail": "info@enatsolution.com",
      "postedDate": "2025-11-14",
      "status": "active"
    },
    {
      "id": 7,
      "title": "Senior Database & Infrastructure Engineer",
      "location": "Remote",
      "type": "IT",
      "employmentType": "Contract (Long-term, Part-time or Full-time)",
      "shortDescription": "Design and maintain high-availability, cloud-based data systems for a global technology company powering data-driven decision-making in the hospitality industry.",
      "fullDescription": "Enat Solution is seeking an experienced Senior Database & Infrastructure Engineer on behalf of a global technology company that powers data-driven decision-making for the hospitality industry.\n\nThe ideal candidate is a hands-on technologist who thrives on building and maintaining high-availability, cloud-based data systems that support mission-critical applications across international clients. You'll help design, optimize, and scale infrastructure that enables hotels and hospitality teams worldwide to make smarter, faster business decisions.",
      "responsibilities": [
        "Design and implement high-availability database systems ensuring performance, reliability, and scalability",
        "Manage and optimize cloud infrastructure supporting large-scale, distributed environments",
        "Monitor and fine-tune database performance to ensure zero downtime operations",
        "Leverage open-source technologies to automate workflows and improve data delivery",
        "Collaborate with cross-functional teams to translate business goals into technical solutions",
        "Continuously evaluate and integrate new technologies to enhance performance and efficiency"
      ],
      "qualifications": [
        "5+ years of professional experience in Database Administration or Infrastructure Engineering",
        "Deep expertise in PostgreSQL (design, tuning, replication, indexing, query optimization)",
        "Hands-on experience with cloud platforms (AWS, Azure, or GCP)",
        "Strong understanding of virtualization, containers, and CI/CD pipelines",
        "Proven ability to maintain zero-downtime production systems",
        "Excellent problem-solving skills, documentation discipline, and communication ability"
      ],
      "benefits": [
        "Compensation: $50 - $80/hour (based on experience)",
        "Work on cutting-edge, global data systems that truly make an impact",
        "Collaborate with a passionate and highly skilled international team",
        "Enjoy a flexible remote schedule and long-term project stability",
        "Partner with a reputable U.S.-based recruiting and consulting agency Enat Solution dedicated to connecting exceptional tech talent with meaningful opportunities"
      ],
      "aboutCompany": "Our partner is a global technology company that powers data-driven decision-making for the hospitality industry. They support mission-critical applications across international clients, enabling hotels and hospitality teams worldwide to make smarter, faster business decisions.",
      "applyEmail": "info@enatsolution.com",
      "postedDate": "2025-11-13",
      "status": "active"
    },
    {
      "id": 6,
      "title": "Database Engineer / Administrator (PostgreSQL + Retool)",
      "location": "Remote",
      "type": "IT",
      "employmentType": "Contract (30+ hours/week, long-term potential)",
      "shortDescription": "Build and optimize a scalable PostgreSQL database for a leading automotive manufacturing company's Product Information Management system.",
      "fullDescription": "Enat Solution is partnering with a leading automotive manufacturing and restoration company that produces custom interior components for classic and vintage vehicles. They're building a powerful Product Information Management (PIM) system that will transform how product data, pricing, and fitment information are managed — and we're looking for an experienced Database Engineer/Administrator to bring this system to life.\n\nThis is your chance to join a growing operation and own the data architecture and tooling behind an entire manufacturing workflow.",
      "responsibilities": [
        "Finalize and implement a scalable PostgreSQL / Supabase database",
        "Optimize performance, indexing, and relational design for complex vehicle fitment data",
        "Develop Retool interfaces for non-technical users (internal tools for customer service and quoting)",
        "Handle data migration and ensure data integrity between systems",
        "Document database schema and architecture for future integration (Shopify, inventory, etc.)",
        "Build intuitive dashboards and lookup tools for part fitment, pricing, and product configuration"
      ],
      "qualifications": [
        "3+ years of professional experience as a Database Engineer, DBA, or Data Architect",
        "Expert knowledge of PostgreSQL (schema design, optimization, indexing)",
        "Experience using Retool to build internal dashboards or tools",
        "Familiarity with Supabase, SQL, and data migration best practices",
        "Strong understanding of relational database design and normalization",
        "Proficiency with Git/GitHub for version control",
        "English fluency (Spanish a plus)"
      ],
      "benefits": [
        "Compensation: $45 – $60/hour (based on experience)",
        "Direct collaboration with experienced business owners",
        "Work on a technically challenging and rewarding project",
        "Flexible remote schedule with potential for long-term extension",
        "Join an established U.S.-based company modernizing its operations with cutting-edge tools"
      ],
      "aboutCompany": "Our partner is a leading automotive manufacturing and restoration company producing custom interior components for classic and vintage vehicles. They are modernizing their operations with cutting-edge tools and seeking talented professionals to drive their digital transformation.",
      "applyEmail": "info@enatsolution.com",
      "postedDate": "2025-11-13",
      "status": "active"
    },
    {
      "id": 2,
      "title": "Respiratory Care Practitioner",
      "location": "Spokane, Washington",
      "type": "Healthcare",
      "employmentType": "Full-Time, Night Shift (36 hours/week)",
      "shortDescription": "Join our respiratory therapy team and deliver exceptional patient care in a leading medical center.",
      "fullDescription": "We are seeking a dedicated and skilled Respiratory Care Practitioner to join a leading medical center in Spokane, WA. The ideal candidate will demonstrate a solid understanding of modern respiratory therapy practices and will work collaboratively with physicians, nurses, and interdisciplinary care teams to deliver exceptional patient care.\n\nIn this role, you'll play a key part in improving patient outcomes through clinical expertise, compassion, and commitment to quality care.",
      "responsibilities": [
        "Perform all aspects of respiratory care, including oxygen and aerosol therapy, ventilator management, airway clearance, and emergency interventions",
        "Collaborate with physicians and nursing staff to plan and implement individualized care plans",
        "Monitor and evaluate patients' responses to treatment and adjust care accordingly",
        "Maintain accurate and detailed patient documentation and reports",
        "Participate in continuing education and maintain all required certifications and competencies",
        "Adhere to all hospital, departmental, and regulatory policies and standards"
      ],
      "qualifications": [
        "Active Washington State Respiratory Care Practitioner License (required)",
        "Basic Life Support (BLS) certification through the American Heart Association (AHA)",
        "Education or training sufficient to meet certification, licensure, or registration requirements",
        "Strong communication and teamwork skills, with a commitment to compassionate, patient-centered care"
      ],
      "benefits": [
        "Comprehensive health coverage, retirement plan with employer matching",
        "Generous paid time off (vacation, holidays, sick days)",
        "Opportunity to work within a respected, mission-driven healthcare organization",
        "Supportive and inclusive work environment that values growth, collaboration, and diversity",
        "Relocation assistance may be available for highly qualified candidates"
      ],
      "aboutCompany": "Our organization provides high-quality, compassionate care across multiple states through home health, hospice, infusion therapy, and community care programs. We are committed to creating an inclusive, supportive environment for both our patients and our team members.",
      "applyEmail": "info@enatsolution.com",
      "postedDate": "2025-10-28",
      "status": "active"
    },
    {
      "id": 1,
      "title": "Nurse Manager - Home Infusion Pharmacy",
      "location": "Spokane Valley, Washington",
      "type": "Healthcare",
      "employmentType": "Full-Time, Day Shift",
      "shortDescription": "Lead our Home Infusion Pharmacy team with clinical expertise and compassionate leadership.",
      "fullDescription": "We are seeking an experienced and compassionate Nurse Manager to lead our Home Infusion Pharmacy team. This individual will oversee clinical operations, ensure high-quality patient care, and support a collaborative work environment for nursing and pharmacy staff serving patients in their homes.\n\nYou will play a key role in coordinating interdisciplinary care, managing staff performance, maintaining compliance with healthcare regulations, and helping improve patient outcomes through innovation and leadership.",
      "responsibilities": [
        "Oversee daily operations of the Home Infusion Department",
        "Supervise and mentor nursing and pharmacy staff",
        "Coordinate interdisciplinary care for patients receiving home infusion therapy",
        "Ensure compliance with quality standards, safety protocols, and documentation requirements",
        "Develop and implement departmental policies, procedures, and performance goals",
        "Monitor staffing levels and productivity standards",
        "Support staff development and training initiatives"
      ],
      "qualifications": [
        "Active RN license in Washington State (Oregon license preferred)",
        "Bachelor's degree in Nursing or related healthcare field (or equivalent experience)",
        "4+ years of home infusion or home health nursing experience",
        "2+ years in a supervisory or nurse management role",
        "Strong leadership, communication, and organizational skills",
        "Passion for patient-centered, holistic care"
      ],
      "benefits": [
        "Comprehensive medical, dental, and vision coverage",
        "401(k) with employer match",
        "Paid time off (vacation, holidays, sick days)",
        "Tuition reimbursement and professional development support",
        "Employee wellness and family care programs"
      ],
      "aboutCompany": "Our organization provides high-quality, compassionate care across multiple states through home health, hospice, infusion therapy, and community care programs. We are committed to creating an inclusive, supportive environment for both our patients and our team members.",
      "applyEmail": "info@enatsolution.com",
      "postedDate": "2025-10-24",
      "status": "active"
    }
  ]
}

