{
  "jobs": [
    {
      "id": 1,
      "title": "Nurse Manager - Home Infusion Pharmacy",
      "location": "Spokane Valley, Washington",
      "type": "Healthcare",
      "employmentType": "Full-Time, Day Shift",
      "shortDescription": "Lead our Home Infusion Pharmacy team with clinical expertise and compassionate leadership.",
      "fullDescription": "We are seeking an experienced and compassionate Nurse Manager to lead our Home Infusion Pharmacy team. This individual will oversee clinical operations, ensure high-quality patient care, and support a collaborative work environment for nursing and pharmacy staff serving patients in their homes.\n\nYou will play a key role in coordinating interdisciplinary care, managing staff performance, maintaining compliance with healthcare regulations, and helping improve patient outcomes through innovation and leadership.",
      "responsibilities": [
        "Oversee daily operations of the Home Infusion Department",
        "Supervise and mentor nursing and pharmacy staff",
        "Coordinate interdisciplinary care for patients receiving home infusion therapy",
        "Ensure compliance with quality standards, safety protocols, and documentation requirements",
        "Develop and implement departmental policies, procedures, and performance goals",
        "Monitor staffing levels and productivity standards",
        "Support staff development and training initiatives"
      ],
      "qualifications": [
        "Active RN license in Washington State (Oregon license preferred)",
        "Bachelor's degree in Nursing or related healthcare field (or equivalent experience)",
        "4+ years of home infusion or home health nursing experience",
        "2+ years in a supervisory or nurse management role",
        "Strong leadership, communication, and organizational skills",
        "Passion for patient-centered, holistic care"
      ],
      "benefits": [
        "Comprehensive medical, dental, and vision coverage",
        "401(k) with employer match",
        "Paid time off (vacation, holidays, sick days)",
        "Tuition reimbursement and professional development support",
        "Employee wellness and family care programs"
      ],
      "aboutCompany": "Our organization provides high-quality, compassionate care across multiple states through home health, hospice, infusion therapy, and community care programs. We are committed to creating an inclusive, supportive environment for both our patients and our team members.",
      "applyEmail": "info@enatsolution.com",
      "postedDate": "2025-10-24",
      "status": "active"
    },
    {
      "id": 2,
      "title": "Respiratory Care Practitioner",
      "location": "Spokane, Washington",
      "type": "Healthcare",
      "employmentType": "Full-Time, Night Shift (36 hours/week)",
      "shortDescription": "Join our respiratory therapy team and deliver exceptional patient care in a leading medical center.",
      "fullDescription": "We are seeking a dedicated and skilled Respiratory Care Practitioner to join a leading medical center in Spokane, WA. The ideal candidate will demonstrate a solid understanding of modern respiratory therapy practices and will work collaboratively with physicians, nurses, and interdisciplinary care teams to deliver exceptional patient care.\n\nIn this role, you'll play a key part in improving patient outcomes through clinical expertise, compassion, and commitment to quality care.",
      "responsibilities": [
        "Perform all aspects of respiratory care, including oxygen and aerosol therapy, ventilator management, airway clearance, and emergency interventions",
        "Collaborate with physicians and nursing staff to plan and implement individualized care plans",
        "Monitor and evaluate patients' responses to treatment and adjust care accordingly",
        "Maintain accurate and detailed patient documentation and reports",
        "Participate in continuing education and maintain all required certifications and competencies",
        "Adhere to all hospital, departmental, and regulatory policies and standards"
      ],
      "qualifications": [
        "Active Washington State Respiratory Care Practitioner License (required)",
        "Basic Life Support (BLS) certification through the American Heart Association (AHA)",
        "Education or training sufficient to meet certification, licensure, or registration requirements",
        "Strong communication and teamwork skills, with a commitment to compassionate, patient-centered care"
      ],
      "benefits": [
        "Comprehensive health coverage, retirement plan with employer matching",
        "Generous paid time off (vacation, holidays, sick days)",
        "Opportunity to work within a respected, mission-driven healthcare organization",
        "Supportive and inclusive work environment that values growth, collaboration, and diversity",
        "Relocation assistance may be available for highly qualified candidates"
      ],
      "aboutCompany": "Our organization provides high-quality, compassionate care across multiple states through home health, hospice, infusion therapy, and community care programs. We are committed to creating an inclusive, supportive environment for both our patients and our team members.",
      "applyEmail": "info@enatsolution.com",
      "postedDate": "2025-10-28",
      "status": "active"
    },
    {
      "id": 5,
      "title": "Administrative Specialist",
      "location": "Various Locations",
      "type": "General",
      "employmentType": "Full/Part-Time",
      "shortDescription": "Support our operations with excellent organizational and administrative skills.",
      "fullDescription": "We are seeking detail-oriented administrative specialists to support our growing organization.",
      "responsibilities": [
        "Manage administrative tasks and schedules",
        "Coordinate office operations",
        "Support multiple departments"
      ],
      "qualifications": [
        "High school diploma or equivalent",
        "2+ years of administrative experience",
        "Strong organizational skills"
      ],
      "benefits": [
        "Flexible schedule",
        "Growth opportunities",
        "Supportive team environment"
      ],
      "aboutCompany": "Our organization provides high-quality, compassionate care across multiple states through home health, hospice, infusion therapy, and community care programs.",
      "applyEmail": "info@enatsolution.com",
      "postedDate": "2025-10-24",
      "status": "active"
    },
    {
      "id": 6,
      "title": "Database Engineer / Administrator (PostgreSQL + Retool)",
      "location": "Remote",
      "type": "IT",
      "employmentType": "Contract (30+ hours/week, long-term potential)",
      "shortDescription": "Build and optimize a scalable PostgreSQL database for a leading automotive manufacturing company's Product Information Management system.",
      "fullDescription": "Enat Solution is partnering with a leading automotive manufacturing and restoration company that produces custom interior components for classic and vintage vehicles. They're building a powerful Product Information Management (PIM) system that will transform how product data, pricing, and fitment information are managed — and we're looking for an experienced Database Engineer/Administrator to bring this system to life.\n\nThis is your chance to join a growing operation and own the data architecture and tooling behind an entire manufacturing workflow.",
      "responsibilities": [
        "Finalize and implement a scalable PostgreSQL / Supabase database",
        "Optimize performance, indexing, and relational design for complex vehicle fitment data",
        "Develop Retool interfaces for non-technical users (internal tools for customer service and quoting)",
        "Handle data migration and ensure data integrity between systems",
        "Document database schema and architecture for future integration (Shopify, inventory, etc.)",
        "Build intuitive dashboards and lookup tools for part fitment, pricing, and product configuration"
      ],
      "qualifications": [
        "3+ years of professional experience as a Database Engineer, DBA, or Data Architect",
        "Expert knowledge of PostgreSQL (schema design, optimization, indexing)",
        "Experience using Retool to build internal dashboards or tools",
        "Familiarity with Supabase, SQL, and data migration best practices",
        "Strong understanding of relational database design and normalization",
        "Proficiency with Git/GitHub for version control",
        "English fluency (Spanish a plus)"
      ],
      "benefits": [
        "Compensation: $45 – $60/hour (based on experience)",
        "Direct collaboration with experienced business owners",
        "Work on a technically challenging and rewarding project",
        "Flexible remote schedule with potential for long-term extension",
        "Join an established U.S.-based company modernizing its operations with cutting-edge tools"
      ],
      "aboutCompany": "Our partner is a leading automotive manufacturing and restoration company producing custom interior components for classic and vintage vehicles. They are modernizing their operations with cutting-edge tools and seeking talented professionals to drive their digital transformation.",
      "applyEmail": "info@enatsolution.com",
      "postedDate": "2025-11-13",
      "status": "active"
    }
  ]
}

